#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.StorageAccount.random_string.random: Refreshing state... [id=su2tg6]
module.ResourceGroup.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/07312005-0589-4526-8ed6-d0a2d92a7ce3/resourceGroups/rg-TerraformExamples01]
module.StorageAccount.azurerm_storage_account.str: Refreshing state... [id=/subscriptions/07312005-0589-4526-8ed6-d0a2d92a7ce3/resourceGroups/rg-TerraformExamples01/providers/Microsoft.Storage/storageAccounts/terraformexample01su2tg6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ResourceGroup.azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/07312005-0589-4526-8ed6-d0a2d92a7ce3/resourceGroups/rg-TerraformExamples01" -> (known after apply)
      ~ name     = "rg-TerraformExamples01" -> "rg-TerraformExamples02" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.StorageAccount.azurerm_storage_account.str must be replaced
-/+ resource "azurerm_storage_account" "str" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/07312005-0589-4526-8ed6-d0a2d92a7ce3/resourceGroups/rg-TerraformExamples01/providers/Microsoft.Storage/storageAccounts/terraformexample01su2tg6" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ name                              = "terraformexample01su2tg6" -> "terraformexample02su2tg6" # forces replacement
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://terraformexample01su2tg6.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "terraformexample01su2tg6.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://terraformexample01su2tg6.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "terraformexample01su2tg6.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://terraformexample01su2tg6.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "terraformexample01su2tg6.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "westus" -> (known after apply)
      ~ primary_queue_endpoint            = "https://terraformexample01su2tg6.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "terraformexample01su2tg6.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://terraformexample01su2tg6.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "terraformexample01su2tg6.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://terraformexample01su2tg6.z22.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "terraformexample01su2tg6.z22.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "rg-TerraformExamples01" -> "rg-TerraformExamples02" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      ~ secondary_location                = "eastus" -> (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      - tags                              = {} -> null
        # (16 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ RgName     = "rg-TerraformExamples01" -> "rg-TerraformExamples02"
  ~ StgActName = "terraformexample01su2tg6" -> "terraformexample02su2tg6"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @ted-repo, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*